posts/2017-05-28-Ryo_Fukui.org
#+title: Ryo Fukui
#+date: <2017-05-28 00:00>
#+MACRO: album - [[$2][$1]] ($3)

Ryo Fukui was a Japanese jazz pianist. He learned to play the piano at
22 and 6 years later released his debut album /Scenery/ in 1976. He
passed away in 2016. Today, you can find most of his released work
online. One album that has escaped is /My Favourite Tune/(1995). A
youtuber with the handle /Marcel The Drunkard/ had a Japanese contact
that evidently recorded many of the original bootlegs of Fukui's
work([[https://www.reddit.com/r/translator/comments/5n8ckh/japanese_english_comment_about_music/?utm_name=frontpage][link]]),
but he did not have a copy.

Here are youtube links to his(often with other artists) albums at this
time:

{{{album(Scenery,https://www.youtube.com/watch?v=Hrr3dp7zRQY, 1976)}}}
{{{album(Mellow Dream,https://www.youtube.com/watch?v=tFxbMrA6Sfo, 1977)}}}
{{{album(In New York,https://www.youtube.com/watch?v=PV8tQmtG3dE, 1999)}}}
{{{album(A Letter from Slowboat,https://www.youtube.com/watch?v=kVV\_z1lBNLo, 2015)}}}
