2017-05-28-Ryo_Fukui.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://notes.neeasade.netrss.xml"
      title="RSS feed for https://notes.neeasade.net"/>
<title>Ryo Fukui</title>
<link href="assets/css/normalize.css" rel="stylesheet">
<link href="assets/css/sakura.css" rel="stylesheet">
<link href="assets/css/notes.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
</div>
<div id="content">
<div class="post-date">28 May 2017</div><h1 class="post-title"><a href="2017-05-28-Ryo_Fukui.html">Ryo Fukui</a></h1>
<p>
Ryo Fukui was a Japanese jazz pianist. He learned to play the piano at
22 and 6 years later released his debut album <i>Scenery</i> in 1976. He
passed away in 2016. Today, you can find most of his released work
online. One album that has escaped is <i>My Favourite Tune/(1995). A
youtuber with the handle /Marcel The Drunkard</i> had a Japanese contact
that evidently recorded many of the original bootlegs of Fukui's
work(<a href="https://www.reddit.com/r/translator/comments/5n8ckh/japanese_english_comment_about_music/?utm_name=frontpage">link</a>),
but he did not have a copy.
</p>

<p>
Here are youtube links to his(often with other artists) albums at this
time:
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=Hrr3dp7zRQY">Scenery</a> ( 1976)</li>
<li><a href="https://www.youtube.com/watch?v=tFxbMrA6Sfo">Mellow Dream</a> ( 1977)</li>
<li><a href="https://www.youtube.com/watch?v=PV8tQmtG3dE">In New York</a> ( 1999)</li>
<li><a href="https://www.youtube.com/watch?v=kVV%5C_z1lBNLo">A Letter from Slowboat</a> ( 2015)</li>
</ul>
</div>
<div id="postamble" class="status">
<a href="archive.html"> Other posts </a></div>
</body>
</html>
